app/Controllers/Auth.php

    public function forgotPasswordPost(): RedirectResponse
    {
        $request = service('request');
        $session = session();
        $email = trim((string) $request->getPost('email'));

        $userModel = new \App\Models\UserModel();
        $user = $userModel->where('email', $email)->first();
        if (!$user) {
            $session->setFlashdata('error', 'If the email exists, a reset link has been sent.');
            return redirect()->back()->withInput();
        }

        $token = bin2hex(random_bytes(32));
        $expiresAt = date('Y-m-d H:i:s', time() + 60 * 30); // 30 minutes
        $userModel->update($user['id'], [
            'password_reset_token' => $token,
            'password_reset_expires_at' => $expiresAt,
        ]);
---
SELECT *
FROM `users`
WHERE `email` = 'carlvesteralbarina@gmail.com'
 LIMIT 1
UPDATE `users` SET `password_reset_token` = '2fde9ca670621cdb5422e870669aaaa83dd1500a2d1609ffd30f38c9bf76e721', `password_reset_expires_at` = '2025-11-11 11:18:16', `updated_at` = '2025-11-11 10:48:16'
WHERE `users`.`id` IN ('5')

    public function validateResetToken(string $token): RedirectResponse
    {
        $userModel = new \App\Models\UserModel();
        $user = $userModel->where('password_reset_token', $token)
            ->where('password_reset_expires_at >=', date('Y-m-d H:i:s'))
            ->first();
---
SELECT *
FROM `users`
WHERE `password_reset_token` = 'd9271e8232e010060b9e47923fde566962d53aafd64d0082b324f6db61dd7f09'
AND `password_reset_expires_at` >= '2025-11-11 10:51:32'
 LIMIT 1

    public function resetPassword(): string
    {
        $session = session();
        $token = $session->get('reset_token');

        if (!$token) {
            $session->setFlashdata('error', 'No valid reset token found. Please request a new password reset.');
            return redirect()->to('/login')->send();
        }

        $userModel = new \App\Models\UserModel();
        $user = $userModel->where('password_reset_token', $token)
            ->where('password_reset_expires_at >=', date('Y-m-d H:i:s'))
            ->first();
---
SELECT *
FROM `users`
WHERE `password_reset_token` = 'd9271e8232e010060b9e47923fde566962d53aafd64d0082b324f6db61dd7f09'
AND `password_reset_expires_at` >= '2025-11-11 10:51:33'
 LIMIT 1